import random


def shuffle(deck):
    random.shuffle(deck)
    return deck


def get_random_card(deck):
    rc = random.choice(deck)
    return rc


def find_key(dict, val):
    key = next((k for k, v in dict.items() if v == val), None)
    return key


CardDeck = {
    # 2
    '2♡': 2,
    '2♤': 3,
    '2♧': 4,
    '2♢': 5,
    # 3
    '3♡': 6,
    '3♤': 7,
    '3♧': 8,
    '3♢': 9,
    # 4
    '4♡': 10,
    '4♤': 11,
    '4♧': 12,
    '4♢': 13,
    # 5
    '5♡': 14,
    '5♤': 15,
    '5♧': 16,
    '5♢': 17,
    # 6
    '6♡': 18,
    '6♤': 19,
    '6♧': 20,
    '6♢': 21,
    # 7
    '7♡': 22,
    '7♤': 23,
    '7♧': 24,
    '7♢': 25,
    # 8
    '8♡': 26,
    '8♤': 27,
    '8♧': 28,
    '8♢': 29,
    # 9
    '9♡': 30,
    '9♤': 31,
    '9♧': 32,
    '9♢': 33,
    # 10
    '10♡': 34,
    '10♤': 35,
    '10♧': 36,
    '10♢': 37,
    # Валет
    'В♡': 38,
    'В♤': 39,
    'В♧': 40,
    'В♢': 41,
    # Дама
    'Д♡': 42,
    'Д♤': 43,
    'Д♧': 44,
    'Д♢': 45,
    # Король
    'К♡': 46,
    'К♤': 47,
    'К♧': 48,
    'К♢': 49,
    # Туз
    'А♡': 50,
    'А♤': 51,
    'А♧': 52,
    'А♢': 53
}
